In [1]:
import pandas as pd

In [5]:
orders = pd.read_csv('orders.csv', na_values=['Fail','abcent',""])
products = pd.read_csv('products.csv')
customers = pd.read_csv('customers.csv')

In [6]:
orders.head()

  order_id customer_id product_id  quantity  order_date
0   O00001       C0333       P022         1  2022-01-09
1   O00002       C0068       P090         1  2022-01-27
2   O00003       C0483       P021         1  2022-01-17
3   O00004       C0214       P076         4  2022-01-07
4   O00005       C0411       P073         4  2022-01-12

In [8]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2584 entries, 0 to 2583
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     2584 non-null   object
 1   customer_id  2584 non-null   object
 2   product_id   2584 non-null   object
 3   quantity     2584 non-null   int64
 4   order_date   2584 non-null   object
dtypes: int64(1), object(4)
memory usage: 101.1+ KB

In [11]:
orders.order_date = pd.to_datetime(orders.order_date)

In [29]:
# filtter your data
top_products = orders[orders['order_date'].dt.year == 2022]['product_id'].value_counts()
top_products

product_id
P059    17
P090    15
P041    15
P099    15
P022    14
        ..
P032     4
P054     3
P023     3
P040     3
P005     3
Name: count, Length: 100, dtype: int64

In [34]:
products[products['product_id']==top_products.index[0]]['product_name']

58    Network
Name: product_name, dtype: object

In [38]:
merged_orders = orders.merge(products[['product_id','price']], on = 'product_id', how ='left')

In [39]:
merged_orders['total_price'] = merged_orders.quantity * merged_orders.price

In [40]:
merged_orders

     order_id customer_id product_id  quantity order_date   price  total_price
0      O00001       C0333       P022         1 2022-01-09  185.33       185.33
1      O00002       C0068       P090         1 2022-01-27  947.55       947.55
2      O00003       C0483       P021         1 2022-01-17  938.65       938.65
3      O00004       C0214       P076         4 2022-01-07  154.17       616.68
4      O00005       C0411       P073         4 2022-01-12  131.85       527.40
...       ...         ...        ...       ...        ...     ...          ...
2579   O02580       C0237       P098         5 2024-12-22  567.31      2836.55
2580   O02581       C0236       P007         1 2024-12-05  325.74       325.74
2581   O02582       C0029       P035         1 2024-12-12  362.04       362.04
2582   O02583       C0171       P077         1 2024-12-16  233.11       233.11
2583   O02584       C0421       P038         5 2024-12-01  817.52      4087.60

[2584 rows x 7 columns]

In [41]:
orders_2022 = merged_orders[merged_orders['order_date'].dt.year == 2022]

In [46]:
customers[customers['customer_id'] == orders_2022.customer_id.value_counts().index[0]]

   customer_id     name  age gender          city
27       C0028  Crystal   61   Male  Theodoreland

In [47]:
revanue = merged_orders['total_price'].sum()

In [48]:
revanue

np.float64(4134260.59)

In [49]:
student_data = pd.read_csv('students_five_classes.csv')

In [50]:
student_data.head()

         roll_no         name  exam1  exam2  final_exam
0  SMIT/DSAI/001  David Iqbal     20     16          35
1  SMIT/DSAI/002  Ahmed Ahmed     13      7          40
2  SMIT/DSAI/003   John Zahid     13     24          47
3  SMIT/DSAI/004  David Brown      0     15          24
4  SMIT/DSAI/005  Fatima Khan     20      8           6

In [51]:
student_data['obtain_marks'] = student_data.iloc[:,2:].sum(axis = 1)

In [52]:
student_data['total_marks'] = 100

In [53]:
student_data['percentage'] = (student_data.obtain_marks / student_data.total_marks)*100

In [54]:
student_data['class'] = student_data['roll_no'].str.split('/').str[1]

In [55]:
def grade(marks):
    if marks>80:
        return 'A'
    elif marks>70:
        return 'B'
    elif marks>50:
        return 'C'
    else:
        return 'F'

In [61]:
student_data['grades'] = student_data.percentage.apply(grade)

In [62]:
student_data

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,class,grades
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100,71.0,DSAI,B
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,40,60,100,60.0,DSAI,C
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100,84.0,DSAI,A
3,SMIT/DSAI/004,David Brown,0,15,24,39,100,39.0,DSAI,F
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100,34.0,DSAI,F
...,...,...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100,63.0,MAW,C
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100,48.0,MAW,F
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100,72.0,MAW,B
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100,46.0,MAW,F
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100,64.0,MAW,C

In [64]:
grouped = student_data.groupby('class')

In [66]:
grouped.get_group('DM')

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,class,grades
100,SMIT/DM/001,Noor Hussain,15,8,34,57,100,57.0,DM,C
101,SMIT/DM/002,Fatima Ahmed,17,14,2,33,100,33.0,DM,F
102,SMIT/DM/003,David Johnson,16,4,41,61,100,61.0,DM,C
103,SMIT/DM/004,Michael Khan,21,18,21,60,100,60.0,DM,C
104,SMIT/DM/005,Noor Malik,22,23,33,78,100,78.0,DM,B
...,...,...,...,...,...,...,...,...,...,...
195,SMIT/DM/096,Ayesha Brown,9,17,21,47,100,47.0,DM,F
196,SMIT/DM/097,Ayesha Iqbal,10,3,11,24,100,24.0,DM,F
197,SMIT/DM/098,Ayesha Ahmed,12,17,45,74,100,74.0,DM,B
198,SMIT/DM/099,Hina Hussain,17,19,41,77,100,77.0,DM,B
199,SMIT/DM/100,Fatima Ali,22,16,34,72,100,72.0,DM,B

In [92]:
for cl in student_data['class'].unique():
    print(cl)
    cl_groups = grouped.get_group(cl)
    print(cl_groups['grades'].value_counts())
    print("Average percentage: ",cl_groups['percentage'].mean())
    print("*"*50)
    first_po_index = cl_groups['percentage'].argmax()
    second_po_index = cl_groups['percentage'].argsort().iloc[-2]
    third_po_index = cl_groups['percentage'].argsort().iloc[-3]
    print("First Position\n",cl_groups.iloc[first_po_index])
    print("*"*50)
    print("Second Position\n",cl_groups.iloc[second_po_index])
    print("*"*50)
    print("Third Position\n",cl_groups.iloc[third_po_index])
    print("*"*50)
    print("*"*50)

DSAI
grades
F    50
C    38
B     8
A     4
Name: count, dtype: int64
Average percentage:  49.89
**************************************************
First Position
 roll_no         SMIT/DSAI/074
name              Ahmed Smith
exam1                      24
exam2                      15
final_exam                 48
obtain_marks               87
total_marks               100
percentage               87.0
class                    DSAI
grades                      A
Name: 73, dtype: object
**************************************************
Second Position
 roll_no         SMIT/DSAI/067
name               Sara Smith
exam1                      14
exam2                      21
final_exam                 49
obtain_marks               84
total_marks               100
percentage               84.0
class                    DSAI
grades                      A
Name: 66, dtype: object
**************************************************
Third Position
 roll_no         SMIT/DSAI/003
name               John Zahid
exam1                      13
exam2                      24
final_exam                 47
obtain_marks               84
total_marks               100
percentage               84.0
class                    DSAI
grades                      A
Name: 2, dtype: object
**************************************************
**************************************************
DM
grades
F    46
C    36
B    13
A     5
Name: count, dtype: int64
Average percentage:  51.86
**************************************************
First Position
 roll_no         SMIT/DM/009
name             Sara Iqbal
exam1                    19
exam2                    17
final_exam               49
obtain_marks             85
total_marks             100
percentage             85.0
class                    DM
grades                    A
Name: 108, dtype: object
**************************************************
Second Position
 roll_no         SMIT/DM/009
name             Sara Iqbal
exam1                    19
exam2                    17
final_exam               49
obtain_marks             85
total_marks             100
percentage             85.0
class                    DM
grades                    A
Name: 108, dtype: object
**************************************************
Third Position
 roll_no         SMIT/DM/047
name            David Ahmed
exam1                    17
exam2                    23
final_exam               43
obtain_marks             83
total_marks             100
percentage             83.0
class                    DM
grades                    A
Name: 146, dtype: object
**************************************************
**************************************************
UIUX
grades
F    58
C    28
B    10
A     4
Name: count, dtype: int64
Average percentage:  48.97
**************************************************
First Position
 roll_no         SMIT/UIUX/033
name             Ayesha Smith
exam1                      21
exam2                      22
final_exam                 49
obtain_marks               92
total_marks               100
percentage               92.0
class                    UIUX
grades                      A
Name: 232, dtype: object
**************************************************
Second Position
 roll_no         SMIT/UIUX/092
name              Ahmed Zahid
exam1                      22
exam2                      24
final_exam                 44
obtain_marks               90
total_marks               100
percentage               90.0
class                    UIUX
grades                      A
Name: 291, dtype: object
**************************************************
Third Position
 roll_no         SMIT/UIUX/089
name                Ali Brown
exam1                      19
exam2                      25
final_exam                 42
obtain_marks               86
total_marks               100
percentage               86.0
class                    UIUX
grades                      A
Name: 288, dtype: object
**************************************************
**************************************************
GD
grades
F    50
C    33
B    14
A     3
Name: count, dtype: int64
Average percentage:  50.17
**************************************************
First Position
 roll_no          SMIT/GD/092
name            Fatima Iqbal
exam1                     20
exam2                     24
final_exam                49
obtain_marks              93
total_marks              100
percentage              93.0
class                     GD
grades                     A
Name: 391, dtype: object
**************************************************
Second Position
 roll_no         SMIT/GD/073
name               Hina Ali
exam1                    21
exam2                    23
final_exam               47
obtain_marks             91
total_marks             100
percentage             91.0
class                    GD
grades                    A
Name: 372, dtype: object
**************************************************
Third Position
 roll_no         SMIT/GD/024
name               Hina Ali
exam1                    23
exam2                    15
final_exam               48
obtain_marks             86
total_marks             100
percentage             86.0
class                    GD
grades                    A
Name: 323, dtype: object
**************************************************
**************************************************
MAW
grades
F    60
C    29
B     9
A     2
Name: count, dtype: int64
Average percentage:  48.65
**************************************************
First Position
 roll_no         SMIT/MAW/006
name            Sara Johnson
exam1                     24
exam2                     22
final_exam                47
obtain_marks              93
total_marks              100
percentage              93.0
class                    MAW
grades                     A
Name: 405, dtype: object
**************************************************
Second Position
 roll_no         SMIT/MAW/092
name              John Smith
exam1                     20
exam2                     23
final_exam                41
obtain_marks              84
total_marks              100
percentage              84.0
class                    MAW
grades                     A
Name: 491, dtype: object
**************************************************
Third Position
 roll_no         SMIT/MAW/073
name              David Khan
exam1                     18
exam2                     23
final_exam                37
obtain_marks              78
total_marks              100
percentage              78.0
class                    MAW
grades                     B
Name: 472, dtype: object
**************************************************
**************************************************

In [93]:
merged_orders

     order_id customer_id product_id  quantity order_date   price  total_price
0      O00001       C0333       P022         1 2022-01-09  185.33       185.33
1      O00002       C0068       P090         1 2022-01-27  947.55       947.55
2      O00003       C0483       P021         1 2022-01-17  938.65       938.65
3      O00004       C0214       P076         4 2022-01-07  154.17       616.68
4      O00005       C0411       P073         4 2022-01-12  131.85       527.40
...       ...         ...        ...       ...        ...     ...          ...
2579   O02580       C0237       P098         5 2024-12-22  567.31      2836.55
2580   O02581       C0236       P007         1 2024-12-05  325.74       325.74
2581   O02582       C0029       P035         1 2024-12-12  362.04       362.04
2582   O02583       C0171       P077         1 2024-12-16  233.11       233.11
2583   O02584       C0421       P038         5 2024-12-01  817.52      4087.60

[2584 rows x 7 columns]